app/views/users/edit.html.erb


  <%= collection_check_boxes :user,:research_interest_ids, ResearchInterest.all, :id, :field do |b| %>
---
SELECT "research_interests".* FROM "research_interests" WHERE 1=0