app/views/users/show.html.erb


  <%= collection_check_boxes :user,:research_interest_ids, ResearchInterest.all, :id, :field do |b| %>
---
SELECT "research_interests"."id" FROM "research_interests"