app/views/events/edit.html.erb


table = Event.all;0 # ";0" stops output.  Change "Event" to any model.

---
SELECT  "events".* FROM "events"  ORDER BY "events"."id" ASC LIMIT 1