calm/app/controllers/announcements_controller.rb

  def show
    id = params[:id] # retrieve announcement ID from URI route
    @announcement = Announcement.find(id) # look up announcement by unique ID
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", 1]]

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'bg-warning hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'bg-warning hilite'
    end
    @all_ratings = Announcement.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')

  def create
    @announcement = Announcement.create!(announcement_params) # combines new and save
---
INSERT INTO "announcements" ("title", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Some content"], ["release_date", "2021-11-01 00:00:00.000000"], ["created_at", "2021-11-01 22:27:39.756083"], ["updated_at", "2021-11-01 22:27:39.756083"]]

  def edit
    @announcement = Announcement.find params[:id]
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @announcement = Announcement.find params[:id]
    @announcement.update_attributes!(announcement_params)
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "announcements" SET "title" = ?, "release_date" = ? WHERE "announcements"."id" = ?  [["title", "New_Announcement"], ["release_date", "2021-11-02 00:00:00.000000"], ["id", 6]]

  def destroy
    @announcement = Announcement.find(params[:id])
    @announcement.destroy
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "announcements" WHERE "announcements"."id" = ?  [["id", 2]]