calm/app/controllers/sessions_controller.rb

    def create
<<<<<<< HEAD
        @user = User.find_by(email: params[:session][:email]) #I guss this already does the sanitization? (Based on: https://stackoverflow.com/questions/21886170/best-way-to-go-about-sanitizing-user-input-in-rails)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "peterwu19881230@gmail.com"]]