app/views/my_account/new.html.erb

SELECT "research_interests".* FROM "research_interests"
---
  <%= label :user,  "Research Interests" %><br />
  <%= collection_check_boxes :user,:research_interest_ids, ResearchInterest.all, :id, :field do |b| %>