app/controllers/announcements_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'bg-warning hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'bg-warning hilite'
    end
    @all_ratings = Announcement.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
    end

    if params[:sort] != session[:sort] or params[:ratings] != session[:ratings]
      session[:sort] = sort
      session[:ratings] = @selected_ratings
      redirect_to :sort => sort, :ratings => @selected_ratings and return
    end
    @announcements = Announcement.where(rating: @selected_ratings.keys).order(ordering)

    if @current_user
      @user_event_ids = UserEvent.where(:user_id => @current_user.id).all.pluck(:event_id)
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
SELECT "user_events"."event_id" FROM "user_events" WHERE "user_events"."user_id" = ?  [["user_id", 6]]

      session[:e_sort] = e_sort
      redirect_to :e_sort => e_sort and return
    end
    @events = Event.all.order(ordering);
---
SELECT "events".* FROM "events"