app/controllers/events_controller.rb

  def show
    id = params[:id] # retrieve Event ID from URI route
    @event = Event.find(id) # look up Event by unique ID
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @event = Event.find params[:id]
    @name = UserEvent.where("event_id = ?", params[:id]).to_a
    @x = @name.map{|x| x.user_id}
---
SELECT  "user_events".* FROM "user_events" WHERE "user_events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]