app/controllers/events_signup_controller.rb

  def create
    event_id = params['event_id']
    if !Event.exists?(event_id)
        flash[:alert] = "Event id #{event_id} does not exist"
        redirect_to root_path
        return
    end

    @userEvent = UserEvent.new(user_id: @current_user.id, event_id: event_id)

    if @userEvent.valid?
      @userEvent.save
---
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["event_id", 1], ["created_at", "2021-12-11 17:38:39.597467"], ["updated_at", "2021-12-11 17:38:39.597467"]]