app/controllers/research_interests_controller.rb

  def index
    @research_interests = ResearchInterest.all
---
SELECT "research_interests".* FROM "research_interests"

  def create
    @research_interest = ResearchInterest.new(research_interest_params)

    if @research_interest.save
---
INSERT INTO "research_interests" ("field", "created_at", "updated_at") VALUES (?, ?, ?)  [["field", "operating system"], ["created_at", "2021-12-02 00:13:26.840509"], ["updated_at", "2021-12-02 00:13:26.840509"]]

  def update
    if @research_interest.update(research_interest_params)
---
UPDATE "research_interests" SET "field" = ?, "updated_at" = ? WHERE "research_interests"."id" = ?  [["field", "operating systems"], ["updated_at", "2021-12-02 07:50:33.996954"], ["id", 1]]

    def set_research_interest
      @research_interest = ResearchInterest.find(params[:id])
---
SELECT  "research_interests".* FROM "research_interests" WHERE "research_interests"."id" = ? LIMIT 1  [["id", 1]]