app/controllers/signup_controller.rb

INSERT INTO "research_interest_users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-12-02 01:24:20.536443"], ["updated_at", "2021-12-02 01:24:20.536443"]]
INSERT INTO "users" ("account_name", "password_digest", "first_name", "last_name", "organization", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    @research_interest_users = ResearchInterestUser.new(user_id = @user_id , research_interest_ids = params[:research_interest_ids])
    @research_interest_users.save