app/controllers/users_controller.rb

UPDATE "users" SET "organization" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["organization", "tamus"], ["updated_at", "2021-12-02 08:19:06.717638"], ["id", 6]]
---
    def update
        current_user

        if @current_user == nil
            redirect_to root_path
            return
        end

        if @current_user.update(user_params)